nc: 80
scales:
  n: [0.33, 0.25, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, MobileNetV4ConvSmall, [3, 32, 0]] # 0-P1/2
  - [-1, 1, MobileNetV4ConvSmall, [32, 32, 1]] # 0-P2/4
  - [-1, 1, MobileNetV4ConvSmall, [32, 64, 2]] # 2-P3
  - [-1, 1, MobileNetV4ConvSmall, [64, 128, 3]] # 3-P4
  - [-1, 1, MobileNetV4ConvSmall, [128, 128, 4]]
  - [-1, 1, MobileNetV4ConvSmall, [128, 256, 5]]
  - [-1, 1, SPPF, [1024, 5]] # 6
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 12 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 15 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 18 (P5/32-large)

  - [[12, 15, 18], 1, Detect, [nc]] # Detect(P3, P4, P5)